test/mutants/patches/883-loadjobdefinitionforcaller-tenantcheck-neutralize.patch
diff --git a/src/WalkingTec.Mvvm.Etl/Scheduling/EtlSchedulerService.cs b/src/WalkingTec.Mvvm.Etl/Scheduling/EtlSchedulerService.cs
index 8282ae6d4..d0b70b434 100644
--- a/src/WalkingTec.Mvvm.Etl/Scheduling/EtlSchedulerService.cs
+++ b/src/WalkingTec.Mvvm.Etl/Scheduling/EtlSchedulerService.cs
@@ -696,7 +696,7 @@ public class EtlSchedulerService
         CancellationToken cancellationToken = default)
     {
         var query = wtm.DC.Set<EtlJobDefinition>().IgnoreQueryFilters().Where(j => j.ID == jobId);
-        if (!declaredSystemQuery)
+        if (false)
         {
             // EF Core translates == against a null callerTenantCode as "TenantCode IS NULL",
             // not "match everything" -- the same null-safe-equality precedent this codebase
