test/mutants/patches/948-restwidget-selectconnectableipasync-policy-consultation-neutralize.patch
diff --git a/src/WalkingTec.Mvvm.Core/Dashboard/RestWidgetDataSource.cs b/src/WalkingTec.Mvvm.Core/Dashboard/RestWidgetDataSource.cs
index b6f72c402..be6fcb477 100644
--- a/src/WalkingTec.Mvvm.Core/Dashboard/RestWidgetDataSource.cs
+++ b/src/WalkingTec.Mvvm.Core/Dashboard/RestWidgetDataSource.cs
@@ -592,7 +592,13 @@ public class RestWidgetDataSource : IWidgetDataSource
             // ValidateUrlAsync (pre-check) and PinnedConnectAsync (connect-time) reach this same
             // call via this same method, so the two never risk building it differently.
             var destination = BuildDestination(requestUri, ip, port, isPlainHttp, requestContext);
-            if (await egressPolicy.IsAllowedAsync(destination, ct).ConfigureAwait(false))
+            // MUTANT test/mutants 948-restwidget-selectconnectableipasync-policy-consultation-neutralize:
+            // `false &&` short-circuits this condition so egressPolicy.IsAllowedAsync is never
+            // actually invoked (the await is never reached), silently reverting the connect-time
+            // layer to "no candidate is ever approved" even when a registered policy would have
+            // approved it. See test/mutants/entries/
+            // 948-restwidget-selectconnectableipasync-policy-consultation-neutralize.json.
+            if (false && await egressPolicy.IsAllowedAsync(destination, ct).ConfigureAwait(false))
             {
                 return ip;
             }
