test/mutants/patches/947-selector-populateselectedentities-replacewhere-reintroduce.patch
diff --git a/src/WalkingTec.Mvvm.Mvc/_FrameworkController.cs b/src/WalkingTec.Mvvm.Mvc/_FrameworkController.cs
--- a/src/WalkingTec.Mvvm.Mvc/_FrameworkController.cs
+++ b/src/WalkingTec.Mvvm.Mvc/_FrameworkController.cs
@@ -2,6 +2,7 @@
 using System.Collections.Generic;
 using System.IO;
 using System.Linq;
+using System.Linq.Expressions;
 using System.Text.Json;
 using System.Threading.Tasks;
 using System.Web;
@@ -412,6 +413,7 @@
                 listVM.NeedPage = false;
                 listVM.SearcherMode = ListVMSearchModeEnum.Batch;
                 Type modelType = listVM.ModelType;
+                var para = Expression.Parameter(modelType);
                 var idproperty = modelType.GetSingleProperty(_DONOT_USE_VFIELD);
                 // Guard: an attacker-supplied _DONOT_USE_VFIELD that names a
                 // non-existent property would cause GetSingleProperty to return
@@ -421,26 +423,8 @@
                 // fall through to return the PartialView with empty SelectData ("[]").
                 if (idproperty != null)
                 {
-                    // #947/#953: SearcherMode is already Batch (above) and ReplaceWhere is
-                    // never set here, so GetDataJson() -> DoSearch() -> GetBatchQuery() takes
-                    // GetBatchQuery()'s default (ReplaceWhere == null) branch — which keeps
-                    // every Where node GetSearchQuery() applies unconditionally, row-level
-                    // DataPrivilege via DPWhere included, instead of deleting all of them the
-                    // way the prior SearcherMode.Batch + (this method's own) ReplaceWhere
-                    // assignment did (WhereReplaceModifier). See GetBatchQuery/
-                    // GetAuthorizedIdsQuery in BasePagedListVM.cs for exactly which Where
-                    // shapes that default branch does and does not suppress — narrower than
-                    // "current UI search criteria is ignored" (#953 review).
-                    //
-                    // Routing through the normal DoSearch() pipeline here — rather than a
-                    // separate call that bypasses it, as an earlier version of this fix did —
-                    // also keeps GetSearchCommand()-backed ListVMs (raw SQL/stored-procedure
-                    // sources, e.g. ActionLogListVM) and Searcher.SortInfo working exactly as
-                    // before #947 (#953 review finding F2).
-                    //
-                    // GetBatchQuery() reads SelectorValueField (not an Expression built here)
-                    // to know which property Ids is matched against.
-                    listVM.SelectorValueField = _DONOT_USE_VFIELD;
+                    var pro = Expression.Property(para, idproperty);
+                    listVM.ReplaceWhere = listVM.Ids.GetContainIdExpression(modelType, Expression.Parameter(modelType), pro);
                     string selectData = SanitizeSelectorJson((listVM as IBasePagedListVM<TopBasePoco, BaseSearcher>).GetDataJson());
                     ViewBag.SelectData = selectData;
                     listVM.IsSearched = false;
