test/mutants/patches/basecrudvm1024-doadd-fileattachment-nav-nulling-neutralize.patch
diff --git a/src/WalkingTec.Mvvm.Core/BaseCRUDVM.cs b/src/WalkingTec.Mvvm.Core/BaseCRUDVM.cs
index b1b088489..613bfb911 100644
--- a/src/WalkingTec.Mvvm.Core/BaseCRUDVM.cs
+++ b/src/WalkingTec.Mvvm.Core/BaseCRUDVM.cs
@@ -560,7 +560,10 @@ namespace WalkingTec.Mvvm.Core
                 {
                     if (pro.PropertyType.GetTypeInfo().IsSubclassOf(typeof(TopBasePoco)))
                     {
-                        pro.SetValue(Entity, null);
+                        // MUTANT test/mutants basecrudvm1024-doadd-fileattachment-nav-nulling-neutralize:
+                        // pro.SetValue(Entity, null); removed (compile-preserving) so a caller-supplied
+                        // nested FileAttachment (or any other TopBasePoco-typed) navigation property
+                        // survives into DC.Set<TModel>().Add(Entity). See test/mutants/manifest.json.
                         string fkname = DC!.GetFKName2<TModel>(pro.Name);
                         var fkpro = pros.Where(x => x.Name == fkname).FirstOrDefault();
                         if (fkpro != null)
