test/mutants/patches/etl862-scheduler-rerunsnapshot-ignorequeryfilters-neutralize.patch
diff --git a/src/WalkingTec.Mvvm.Etl/Scheduling/EtlSchedulerService.cs b/src/WalkingTec.Mvvm.Etl/Scheduling/EtlSchedulerService.cs
index 0000000..0000000 100644
--- a/src/WalkingTec.Mvvm.Etl/Scheduling/EtlSchedulerService.cs
+++ b/src/WalkingTec.Mvvm.Etl/Scheduling/EtlSchedulerService.cs
@@ -447,7 +447,7 @@ namespace WalkingTec.Mvvm.Etl.Scheduling;
         // #862: IgnoreQueryFilters() -- see class remarks; FindAsync cannot bypass filters.
         // #883: TenantCode predicate added below (unless declaredSystemQuery) so a caller can
         // never rerun from another tenant's run-log snapshot.
-        var runLogQuery = wtm.DC.Set<EtlRunLog>().IgnoreQueryFilters().Where(r => r.ID == runLogId);
+        var runLogQuery = wtm.DC.Set<EtlRunLog>().Where(r => r.ID == runLogId);
         if (!declaredSystemQuery)
         {
             runLogQuery = runLogQuery.Where(r => r.TenantCode == callerTenantCode);
