test/mutants/patches/fileapi830-csname-guard-neutralize.patch
diff --git a/demo/WalkingTec.Mvvm.Demo/Areas/_Admin/ApiControllers/FileApiController.cs b/demo/WalkingTec.Mvvm.Demo/Areas/_Admin/ApiControllers/FileApiController.cs
index f7955ffc3..af7428b88 100644
--- a/demo/WalkingTec.Mvvm.Demo/Areas/_Admin/ApiControllers/FileApiController.cs
+++ b/demo/WalkingTec.Mvvm.Demo/Areas/_Admin/ApiControllers/FileApiController.cs
@@ -255,7 +255,10 @@ namespace WalkingTec.Mvvm.Admin.Api
         [ActionDescription("DeleteFile")]
         public IActionResult DeletedFile([FromServices] WtmFileProvider fp, string id, string csName = null)
         {
-            if (!IsKnownConnectionKey(csName))
+            // MUTANT test/mutants fileapi830-csname-guard-neutralize: neutralizes the condition
+            // (compile-preserving: `&& false`, not a deletion) so the guard can never fire. See
+            // test/mutants/manifest.json.
+            if (!IsKnownConnectionKey(csName) && false)
             {
                 return BadRequest("Unknown connection string key");
             }
