test/mutants/patches/fileapi857-public-downloadfile-reintroduce.patch
diff --git a/demo/WalkingTec.Mvvm.Demo/Areas/_Admin/ApiControllers/FileApiController.cs b/demo/WalkingTec.Mvvm.Demo/Areas/_Admin/ApiControllers/FileApiController.cs
index cc79681f7..3a8a78aa1 100644
--- a/demo/WalkingTec.Mvvm.Demo/Areas/_Admin/ApiControllers/FileApiController.cs
+++ b/demo/WalkingTec.Mvvm.Demo/Areas/_Admin/ApiControllers/FileApiController.cs
@@ -237,6 +237,9 @@ namespace WalkingTec.Mvvm.Admin.Api
 
         [HttpGet("[action]/{id}")]
         [ActionDescription("DownloadFile")]
+        // MUTANT test/mutants fileapi857-public-downloadfile-reintroduce: re-adds [Public]
+        // (compile-preserving: an attribute add, not a statement delete). See test/mutants/manifest.json.
+        [Public]
         public IActionResult DownloadFile([FromServices] WtmFileProvider fp, string id, string csName = null)
         {
             if (!IsKnownConnectionKey(csName))
