test/mutants/patches/wtmsec867-gateway-type-guard-neutralize.patch
diff --git a/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs b/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs
index 8b5813a5f..e5099fa39 100644
--- a/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs
+++ b/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs
@@ -385,7 +385,10 @@ namespace WalkingTec.Mvvm.Core
                 if (IsStaticMember(member)) return BindingRejectionReason.StaticMember;
 
                 var memberType = member.GetMemberType();
-                if (IsBannedGatewayType(memberType)) return BindingRejectionReason.GatewayType;
+                // MUTANT test/mutants wtmsec867-gateway-type-guard-neutralize: condition
+                // neutralized (compile-preserving `&& false`) so the gateway-TYPE guard can never
+                // reject a path. See test/mutants/entries/wtmsec867-gateway-type-guard-neutralize.json.
+                if (IsBannedGatewayType(memberType) && false) return BindingRejectionReason.GatewayType;
 
                 tempType = memberType;
                 if (!isLastSegment && tempType != null)
