test/mutants/patches/wtmsec867-static-member-guard-neutralize.patch
diff --git a/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs b/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs
index 8b5813a5f..b30bdbdad 100644
--- a/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs
+++ b/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs
@@ -382,7 +382,11 @@ namespace WalkingTec.Mvvm.Core
                 }
                 var member = members[0];
 
-                if (IsStaticMember(member)) return BindingRejectionReason.StaticMember;
+                // MUTANT test/mutants wtmsec867-static-member-guard-neutralize: condition
+                // neutralized (compile-preserving `&& false`) so the static-member guard can
+                // never reject a path. See test/mutants/entries/
+                // wtmsec867-static-member-guard-neutralize.json for the mutant record.
+                if (IsStaticMember(member) && false) return BindingRejectionReason.StaticMember;
 
                 var memberType = member.GetMemberType();
                 if (IsBannedGatewayType(memberType)) return BindingRejectionReason.GatewayType;
