test/mutants/patches/wtmsec867-zero-resolution-guard-neutralize.patch
diff --git a/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs b/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs
index 03a63e932..d89989402 100644
--- a/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs
+++ b/src/WalkingTec.Mvvm.Core/Helper/RequestBindingPolicy.cs
@@ -233,7 +233,11 @@ namespace WalkingTec.Mvvm.Core
                     // This policy cannot safely allow a key it failed to fully resolve, so it
                     // fails closed here instead of trying to replicate that frozen-type fallback
                     // (which would also have to be kept in lockstep with PropertyHelper forever).
-                    return false;
+                    // MUTANT test/mutants wtmsec867-zero-resolution-guard-neutralize: reverted to
+                    // the pre-fix `break` (falls through to `return true` below) instead of
+                    // `return false`. See test/mutants/entries/
+                    // wtmsec867-zero-resolution-guard-neutralize.json for the mutant record.
+                    break;
                 }
                 if (members.Length > 1)
                 {
